Revit 2027 API
PanelScheduleData.SetBorderAroundSections Method
 Adds a border around the sections
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBorderAroundSections(
	ElementId borderId
)
Public Sub SetBorderAroundSections (
	borderId As ElementId
)
public:
void SetBorderAroundSections(
	ElementId^ borderId
)
member SetBorderAroundSections :
        borderId : ElementId -> unit
Parameters
borderId ElementId
 The border to set around the sections
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace